Improve project documentation
